In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.DataFrame({
    'Sex': ['M','F','F','D','?'],
    'Age':[29,30,24,290,25]
})

In [3]:
df

  Sex  Age
0   M   29
1   F   30
2   F   24
3   D  290
4   ?   25

finding unique values

In [4]:
df['Sex'].unique()

array(['M', 'F', 'D', '?'], dtype=object)

In [6]:
df['Sex'].value_counts() #quick summury of all unique values of the datasets

Sex
F    2
M    1
D    1
?    1
Name: count, dtype: int64

In [20]:
#replace function works like a dictioneryn with key and value pairs 

df2=df.replace({
    'Sex': {
        'D':'F',
        'N':'M'
    },
    'Age': {
        30:15
    }
})

In [8]:
df['Age'] > 100

0    False
1    False
2    False
3     True
4    False
Name: Age, dtype: bool

In [16]:
df[df['Age'] > 100] #290 is an invalid age for a human so we fix it by dividing by 10

Empty DataFrame
Columns: [Sex, Age]
Index: []

In [11]:
df.loc[df['Age'] >100, 'Age'] =  df.loc[df['Age'] >100, 'Age'] /10

In [15]:
df

  Sex  Age
0   M   29
1   F   30
2   F   24
3   D   29
4   ?   25

In [19]:
df

  Sex  Age
0   M   29
1   F   30
2   F   24
3   D   29
4   ?   25

In [21]:
df2

  Sex  Age
0   M   29
1   F   15
2   F   24
3   F   29
4   ?   25

handling duplicate values

In [33]:
amb = pd.Series([
    'France', 
    'United Kingdom',
    'United Kingdom',
    'Italy',
    'Germany',
    'Germany',
    'Germany',
],index=[
    'Gerrard Arrad',
    'Kim Darroch',
    'Peter Westcott',
    'Armando Varrichio',
    'Peter Witting',
    'Peter Ammon',
    'Klaus Scharioth'
])

In [34]:
amb

Gerrard Arrad                France
Kim Darroch          United Kingdom
Peter Westcott       United Kingdom
Armando Varrichio             Italy
Peter Witting               Germany
Peter Ammon                 Germany
Klaus Scharioth             Germany
dtype: object

In [38]:
# duplicated will tell which values are duplicates, the second values onwards after the first value has been created is consired as a duplicate
amb[amb.duplicated()]

Peter Westcott     United Kingdom
Peter Ammon               Germany
Klaus Scharioth           Germany
dtype: object

In [46]:
new = amb[amb.duplicated(keep=False)] #everyrhing written more than once is consired as duplicate
new

Kim Darroch        United Kingdom
Peter Westcott     United Kingdom
Peter Witting             Germany
Peter Ammon               Germany
Klaus Scharioth           Germany
dtype: object

In [47]:
amb.drop_duplicates() #removes the duplicates and keeps the first instance recorded

Gerrard Arrad                France
Kim Darroch          United Kingdom
Armando Varrichio             Italy
Peter Witting               Germany
dtype: object

In [48]:
amb.drop_duplicates(keep='last') #the last one not duplicate

Gerrard Arrad                France
Peter Westcott       United Kingdom
Armando Varrichio             Italy
Klaus Scharioth             Germany
dtype: object

duplicates in data frames

In [58]:
players = pd.DataFrame({
    'Name': [
        'Andre Onana', 'Harry Maguire', 'Lisandro Martinez', 'Bruno fernandez', 'Alejandro Garnacho','Kobbie Maino'
    ],
    'Jersey Number': [35, 5, 6,8,17,45],
    'Age': [28, 27, 23, 29, 17, 17],
    'Previous Club': ['Inter Milan','Leicester City','Ajax Amsterdam','Sporting Lisbon','Academy Graduate', 'Academy Graduate'],
    'Foot': ['Right', 'Right', 'Left','Right','Right','Right'],
    'Nationality': ['Cameroon', 'England', 'Argentina', 'Portugal','Argentina', 'England' ],    
    'Position': [
        'Goalkeeper', 'Center back', 'Center back', 'Attacking Midfielder', 'Right Winger','Defensive Midfielder'
    ]
})
players

,Name,Jersey Number,Age,Previous Club,Foot,Nationality,Position
0,Andre Onana,35,28,Inter Milan,Right,Cameroon,Goalkeeper
1,Harry Maguire,5,27,Leicester City,Right,England,Center back
2,Lisandro Martinez,6,23,Ajax Amsterdam,Left,Argentina,Center back
3,Bruno fernandez,8,29,Sporting Lisbon,Right,Portugal,Attacking Midfielder
4,Alejandro Garnacho,17,17,Academy Graduate,Right,Argentina,Right Winger
5,Kobbie Maino,45,17,Academy Graduate,Right,England,Defensive Midfielder

In [59]:
players.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
dtype: bool

In [61]:
players[players['Nationality'].duplicated(keep=False)]

,Name,Jersey Number,Age,Previous Club,Foot,Nationality,Position
1,Harry Maguire,5,27,Leicester City,Right,England,Center back
2,Lisandro Martinez,6,23,Ajax Amsterdam,Left,Argentina,Center back
4,Alejandro Garnacho,17,17,Academy Graduate,Right,Argentina,Right Winger
5,Kobbie Maino,45,17,Academy Graduate,Right,England,Defensive Midfielder

In [63]:
players['Nationality'].duplicated(keep=False)

0    False
1     True
2     True
3    False
4     True
5     True
Name: Nationality, dtype: bool

In [64]:
players.loc[2]

Name             Lisandro Martinez
Jersey Number                    6
Age                             23
Previous Club       Ajax Amsterdam
Foot                          Left
Nationality              Argentina
Position               Center back
Name: 2, dtype: object

In [65]:
players.loc[5]

Name                     Kobbie Maino
Jersey Number                      45
Age                                17
Previous Club        Academy Graduate
Foot                            Right
Nationality                   England
Position         Defensive Midfielder
Name: 5, dtype: object

In [69]:
players.duplicated(subset=['Nationality'])

0    False
1    False
2    False
3    False
4     True
5     True
dtype: bool

In [71]:
players[players.duplicated(subset=['Nationality'], keep='last')]

,Name,Jersey Number,Age,Previous Club,Foot,Nationality,Position
1,Harry Maguire,5,27,Leicester City,Right,England,Center back
2,Lisandro Martinez,6,23,Ajax Amsterdam,Left,Argentina,Center back